* Tirroirs ('Drawers')
  :LOGBOOK:  
  - Note taken on [2015-02-03 mar. 11:20] \\
    La version que j'utilise actuellement, ne permet pas de tester cette fonctionnalité.
  :END:      
  À partir de 8.3, il n'est plus nécessaire de délarer les tirroirs avant leur utilisation
  
** Exemple en 8.2.7
   :mon_tirroir: 
   Ceci est le contenu du mon tirroir inséré par *C-c C-x d*.
   :END:      
   Ici on remarque que le tirroir doit être préalablement déclaré.
* Le parser
  #+begin_src elisp :results verbatim :wrap structure-interne
  (org-element-parse-buffer)
  #+end_src

  #+RESULTS:
  #+BEGIN_structure-interne
  (org-data nil (headline (:raw-value "Tirroirs ('Drawers')" :begin 1 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 24 :contents-end 462 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY "nl-xxx-org-mode-manual-B3" :title (#("Tirroirs ('Drawers')" 0 20 (:parent #1))) :parent #0) (section (:begin 24 :end 280 :contents-begin 24 :contents-end 277 :post-blank 1 :parent #1) (drawer (:begin 24 :end 186 :drawer-name "LOGBOOK" :hiddenp outline :contents-begin 38 :contents-end 172 :post-blank 0 :post-affiliated 24 :parent #2) (plain-list (:type unordered :begin 38 :end 172 :contents-begin 38 :contents-end 172 :structure ((38 2 "- " nil nil nil 172)) :post-blank 0 :post-affiliated 38 :parent #3) (item (:bullet "- " :begin 38 :end 172 :contents-begin 42 :contents-end 172 :checkbox nil :counter nil :hiddenp outline :structure ((38 2 "- " nil nil nil 172)) :post-blank 0 :tag nil :parent #4) (paragraph (:begin 42 :end 172 :contents-begin 42 :contents-end 172 :post-blank 0 :post-affiliated 42 :parent #5) #("Note taken on " 0 14 (:parent #6)) (timestamp (:type inactive :raw-value "[2015-02-03 mar. 11:20]" :year-start 2015 :month-start 2 :day-start 3 :hour-start 11 :minute-start 20 :year-end 2015 :month-end 2 :day-end 3 :hour-end 11 :minute-end 20 :begin 56 :end 80 :post-blank 1 :parent #6)) (line-break (:begin 80 :end 83 :post-blank 0 :parent #6)) #("    La version que j'utilise actuellement, ne permet pas de tester cette fonctionnalité.
  " 0 89 (:parent #6)))))) (paragraph (:begin 186 :end 277 :contents-begin 186 :contents-end 277 :post-blank 0 :post-affiliated 186 :parent #2) #("  À partir de 8.3, il n'est plus nécessaire de délarer les tirroirs avant leur utilisation
  " 0 91 (:parent #3)))) (headline (:raw-value "Exemple en 8.2.7" :begin 280 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 300 :contents-end 462 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY "nl-xxx-org-mode-manual-B3" :title (#("Exemple en 8.2.7" 0 16 (:parent #2))) :parent #1) (section (:begin 300 :end 462 :contents-begin 300 :contents-end 462 :post-blank 0 :parent #2) (paragraph (:begin 300 :end 380 :contents-begin 300 :contents-end 380 :post-blank 0 :post-affiliated 300 :parent #3) #("   :mon" 0 7 (:parent #4)) (subscript (:begin 307 :end 315 :use-brackets-p nil :contents-begin 308 :contents-end 315 :post-blank 0 :parent #4) #("tirroir" 0 7 (:parent #5))) #(": 
     Ceci est le contenu du mon tirroir inséré par " 0 52 (:parent #4)) (bold (:begin 367 :end 378 :contents-begin 368 :contents-end 377 :post-blank 0 :parent #4) #("C-c C-x d" 0 9 (:parent #5))) #(".
  " 0 2 (:parent #4))) (paragraph (:begin 380 :end 462 :contents-begin 380 :contents-end 462 :post-blank 0 :post-affiliated 380 :parent #3) #("   :END:      
     Ici on remarque que le tirroir doit être préalablement déclaré.
  " 0 82 (:parent #4)))))) (headline (:raw-value "Le parser" :begin 462 :end 13939 :pre-blank 0 :hiddenp nil :contents-begin 474 :contents-end 13938 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nil :title (#("Le parser" 0 9 (:parent #1))) :parent #0) (section (:begin 474 :end 13939 :contents-begin 474 :contents-end 13938 :post-blank 1 :parent #1) (src-block (:language "elisp" :switches nil :parameters ":results verbatim :wrap structure-interne" :begin 474 :end 578 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :hiddenp nil :value "(org-element-parse-buffer)
  " :post-blank 1 :post-affiliated 474 :parent #2)) (fixed-width (:begin 578 :end 13938 :value "(org-data nil (headline (:raw-value \"Tirroirs ('Drawers')\" :begin 1 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 24 :contents-end 462 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY \"nl-xxx-org-mode-manual-B3\" :title (#(\"Tirroirs ('Drawers')\" 0 20 (:parent #1))) :parent #0) (section (:begin 24 :end 280 :contents-begin 24 :contents-end 277 :post-blank 1 :parent #1) (drawer (:begin 24 :end 186 :drawer-name \"LOGBOOK\" :hiddenp outline :contents-begin 38 :contents-end 172 :post-blank 0 :post-affiliated 24 :parent #2) (plain-list (:type unordered :begin 38 :end 172 :contents-begin 38 :contents-end 172 :structure ((38 2 \"- \" nil nil nil 172)) :post-blank 0 :post-affiliated 38 :parent #3) (item (:bullet \"- \" :begin 38 :end 172 :contents-begin 42 :contents-end 172 :checkbox nil :counter nil :hiddenp outline :structure ((38 2 \"- \" nil nil nil 172)) :post-blank 0 :tag nil :parent #4) (paragraph (:begin 42 :end 172 :contents-begin 42 :contents-end 172 :post-blank 0 :post-affiliated 42 :parent #5) #(\"Note taken on \" 0 14 (:parent #6)) (timestamp (:type inactive :raw-value \"[2015-02-03 mar. 11:20]\" :year-start 2015 :month-start 2 :day-start 3 :hour-start 11 :minute-start 20 :year-end 2015 :month-end 2 :day-end 3 :hour-end 11 :minute-end 20 :begin 56 :end 80 :post-blank 1 :parent #6)) (line-break (:begin 80 :end 83 :post-blank 0 :parent #6)) #(\"    La version que j'utilise actuellement, ne permet pas de tester cette fonctionnalité.
  \" 0 89 (:parent #6)))))) (paragraph (:begin 186 :end 277 :contents-begin 186 :contents-end 277 :post-blank 0 :post-affiliated 186 :parent #2) #(\"  À partir de 8.3, il n'est plus nécessaire de délarer les tirroirs avant leur utilisation
  \" 0 91 (:parent #3)))) (headline (:raw-value \"Exemple en 8.2.7\" :begin 280 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 300 :contents-end 462 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY \"nl-xxx-org-mode-manual-B3\" :title (#(\"Exemple en 8.2.7\" 0 16 (:parent #2))) :parent #1) (section (:begin 300 :end 462 :contents-begin 300 :contents-end 462 :post-blank 0 :parent #2) (paragraph (:begin 300 :end 380 :contents-begin 300 :contents-end 380 :post-blank 0 :post-affiliated 300 :parent #3) #(\"   :mon\" 0 7 (:parent #4)) (subscript (:begin 307 :end 315 :use-brackets-p nil :contents-begin 308 :contents-end 315 :post-blank 0 :parent #4) #(\"tirroir\" 0 7 (:parent #5))) #(\": 
     Ceci est le contenu du mon tirroir inséré par \" 0 52 (:parent #4)) (bold (:begin 367 :end 378 :contents-begin 368 :contents-end 377 :post-blank 0 :parent #4) #(\"C-c C-x d\" 0 9 (:parent #5))) #(\".
  \" 0 2 (:parent #4))) (paragraph (:begin 380 :end 462 :contents-begin 380 :contents-end 462 :post-blank 0 :post-affiliated 380 :parent #3) #(\"   :END:      
     Ici on remarque que le tirroir doit être préalablement déclaré.
  \" 0 82 (:parent #4)))))) (headline (:raw-value \"Le parser\" :begin 462 :end 7461 :pre-blank 0 :hiddenp nil :contents-begin 474 :contents-end 7460 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nil :title (#(\"Le parser\" 0 9 (:parent #1))) :parent #0) (section (:begin 474 :end 7461 :contents-begin 474 :contents-end 7460 :post-blank 1 :parent #1) (src-block (:language \"elisp\" :switches nil :parameters \":results verbatim\" :begin 474 :end 554 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :hiddenp nil :value \"(org-element-parse-buffer)
  \" :post-blank 1 :post-affiliated 474 :parent #2)) (table (:begin 554 :end 7460 :type org :tblfm nil :contents-begin 567 :contents-end 7460 :value nil :post-blank 0 :post-affiliated 567 :results (\"\") :parent #2) (table-row (:type standard :begin 567 :end 7460 :contents-begin 570 :contents-end 7459 :post-blank 0 :parent #3) (table-cell (:begin 570 :end 581 :contents-begin 571 :contents-end 579 :post-blank 0 :parent #4) #(\"org-data\" 0 8 (:parent #5))) (table-cell (:begin 581 :end 587 :contents-begin 582 :contents-end 585 :post-blank 0 :parent #4) #(\"nil\" 0 3 (:parent #5))) (table-cell (:begin 587 :end 4023 :contents-begin 588 :contents-end 4021 :post-blank 0 :parent #4) #(\"(headline (:raw-value Tirroirs ('Drawers') :begin 1 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 24 :contents-end 462 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nl-xxx-org-mode-manual-B3 :title (Tirroirs ('Drawers')) :parent (org-data nil #0 (headline (:raw-value Le parser :begin 462 :end 534 :pre-blank 0 :hiddenp nil :contents-begin 474 :contents-end 534 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nil :title (Le parser) :parent #2) (section (:begin 474 :end 534 :contents-begin 474 :contents-end 534 :post-blank 0 :parent #3) (src-block (:language elisp :switches nil :parameters nil :begin 474 :end 534 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :hiddenp nil :value (org-element-parse-buffer)\" 0 975 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 1563 :end 1566 :post-blank 1 :parent #5)) #(\":post-blank 0 :post-affiliated 474 :parent #4)))))) (section (:begin 24 :end 280 :contents-begin 24 :contents-end 277 :post-blank 1 :parent #0) (drawer (:begin 24 :end 186 :drawer-name LOGBOOK :hiddenp outline :contents-begin 38 :contents-end 172 :post-blank 0 :post-affiliated 24 :parent #1) (plain-list (:type unordered :begin 38 :end 172 :contents-begin 38 :contents-end 172 :structure ((38 2 -  nil nil nil 172)) :post-blank 0 :post-affiliated 38 :parent #2) (item (:bullet -  :begin 38 :end 172 :contents-begin 42 :contents-end 172 :checkbox nil :counter nil :hiddenp outline :structure ((38 2 -  nil nil nil 172)) :post-blank 0 :tag nil :parent #3) (paragraph (:begin 42 :end 172 :contents-begin 42 :contents-end 172 :post-blank 0 :post-affiliated 42 :parent #4) Note taken on  (timestamp (:type inactive :raw-value \" 0 822 (:parent #5)) (timestamp (:type inactive :raw-value \"[2015-02-03 mar. 11:20]\" :year-start 2015 :month-start 2 :day-start 3 :hour-start 11 :minute-start 20 :year-end 2015 :month-end 2 :day-end 3 :hour-end 11 :minute-end 20 :begin 2388 :end 2412 :post-blank 1 :parent #5)) #(\":year-start 2015 :month-start 2 :day-start 3 :hour-start 11 :minute-start 20 :year-end 2015 :month-end 2 :day-end 3 :hour-end 11 :minute-end 20 :begin 56 :end 80 :post-blank 1 :parent #5)) (line-break (:begin 80 :end 83 :post-blank 0 :parent #5))     La version que j'utilise actuellement, ne permet pas de tester cette fonctionnalité.\" 0 335 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 2747 :end 2749 :post-blank 0 :parent #5)) #(\")))) (paragraph (:begin 186 :end 277 :contents-begin 186 :contents-end 277 :post-blank 0 :post-affiliated 186 :parent #1)   À partir de 8.3, il n'est plus nécessaire de délarer les tirroirs avant leur utilisation\" 0 212 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 2961 :end 2963 :post-blank 0 :parent #5)) #(\")) (headline (:raw-value Exemple en 8.2.7 :begin 280 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 300 :contents-end 462 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nl-xxx-org-mode-manual-B3 :title (Exemple en 8.2.7) :parent #0) (section (:begin 300 :end 462 :contents-begin 300 :contents-end 462 :post-blank 0 :parent #1) (paragraph (:begin 300 :end 380 :contents-begin 300 :contents-end 380 :post-blank 0 :post-affiliated 300 :parent #2)    :mon (subscript (:begin 307 :end 315 :use-brackets-p nil :contents-begin 308 :contents-end 315 :post-blank 0 :parent #3) tirroir) : \" 0 694 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 3657 :end 3662 :post-blank 3 :parent #5)) #(\"Ceci est le contenu du mon tirroir inséré par  (bold (:begin 367 :end 378 :contents-begin 368 :contents-end 377 :post-blank 0 :parent #3) C-c C-x d) .\" 0 150 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 3812 :end 3814 :post-blank 0 :parent #5)) #(\") (paragraph (:begin 380 :end 462 :contents-begin 380 :contents-end 462 :post-blank 0 :post-affiliated 380 :parent #2)    :END:      \" 0 133 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 3947 :end 3952 :post-blank 3 :parent #5)) #(\"Ici on remarque que le tirroir doit être préalablement déclaré.\" 0 63 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 4015 :end 4017 :post-blank 0 :parent #5)) #(\"))))\" 0 4 (:parent #5))) (table-cell (:begin 4023 :end 7459 :contents-begin 4024 :contents-end 7457 :post-blank 0 :parent #4) #(\"(headline (:raw-value Le parser :begin 462 :end 534 :pre-blank 0 :hiddenp nil :contents-begin 474 :contents-end 534 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nil :title (Le parser) :parent (org-data nil (headline (:raw-value Tirroirs ('Drawers') :begin 1 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 24 :contents-end 462 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nl-xxx-org-mode-manual-B3 :title (Tirroirs ('Drawers')) :parent #2) (section (:begin 24 :end 280 :contents-begin 24 :contents-end 277 :post-blank 1 :parent #3) (drawer (:begin 24 :end 186 :drawer-name LOGBOOK :hiddenp outline :contents-begin 38 :contents-end 172 :post-blank 0 :post-affiliated 24 :parent #4) (plain-list (:type unordered :begin 38 :end 172 :contents-begin 38 :contents-end 172 :structure ((38 2 -  nil nil nil 172)) :post-blank 0 :post-affiliated 38 :parent #5) (item (:bullet -  :begin 38 :end 172 :contents-begin 42 :contents-end 172 :checkbox nil :counter nil :hiddenp outline :structure ((38 2 -  nil nil nil 172)) :post-blank 0 :tag nil :parent #6) (paragraph (:begin 42 :end 172 :contents-begin 42 :contents-end 172 :post-blank 0 :post-affiliated 42 :parent #7) Note taken on  (timestamp (:type inactive :raw-value \" 0 1439 (:parent #5)) (timestamp (:type inactive :raw-value \"[2015-02-03 mar. 11:20]\" :year-start 2015 :month-start 2 :day-start 3 :hour-start 11 :minute-start 20 :year-end 2015 :month-end 2 :day-end 3 :hour-end 11 :minute-end 20 :begin 5463 :end 5487 :post-blank 1 :parent #5)) #(\":year-start 2015 :month-start 2 :day-start 3 :hour-start 11 :minute-start 20 :year-end 2015 :month-end 2 :day-end 3 :hour-end 11 :minute-end 20 :begin 56 :end 80 :post-blank 1 :parent #8)) (line-break (:begin 80 :end 83 :post-blank 0 :parent #8))     La version que j'utilise actuellement, ne permet pas de tester cette fonctionnalité.\" 0 335 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 5822 :end 5824 :post-blank 0 :parent #5)) #(\")))) (paragraph (:begin 186 :end 277 :contents-begin 186 :contents-end 277 :post-blank 0 :post-affiliated 186 :parent #4)   À partir de 8.3, il n'est plus nécessaire de délarer les tirroirs avant leur utilisation\" 0 212 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 6036 :end 6038 :post-blank 0 :parent #5)) #(\")) (headline (:raw-value Exemple en 8.2.7 :begin 280 :end 462 :pre-blank 0 :hiddenp nil :contents-begin 300 :contents-end 462 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY nl-xxx-org-mode-manual-B3 :title (Exemple en 8.2.7) :parent #3) (section (:begin 300 :end 462 :contents-begin 300 :contents-end 462 :post-blank 0 :parent #4) (paragraph (:begin 300 :end 380 :contents-begin 300 :contents-end 380 :post-blank 0 :post-affiliated 300 :parent #5)    :mon (subscript (:begin 307 :end 315 :use-brackets-p nil :contents-begin 308 :contents-end 315 :post-blank 0 :parent #6) tirroir) : \" 0 694 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 6732 :end 6737 :post-blank 3 :parent #5)) #(\"Ceci est le contenu du mon tirroir inséré par  (bold (:begin 367 :end 378 :contents-begin 368 :contents-end 377 :post-blank 0 :parent #6) C-c C-x d) .\" 0 150 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 6887 :end 6889 :post-blank 0 :parent #5)) #(\") (paragraph (:begin 380 :end 462 :contents-begin 380 :contents-end 462 :post-blank 0 :post-affiliated 380 :parent #5)    :END:      \" 0 133 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 7022 :end 7027 :post-blank 3 :parent #5)) #(\"Ici on remarque que le tirroir doit être préalablement déclaré.\" 0 63 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 7090 :end 7092 :post-blank 0 :parent #5)) #(\")))) #0)) (section (:begin 474 :end 534 :contents-begin 474 :contents-end 534 :post-blank 0 :parent #0) (src-block (:language elisp :switches nil :parameters nil :begin 474 :end 534 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :hiddenp nil :value (org-element-parse-buffer)\" 0 313 (:parent #5)) (latex-fragment (:value \"\\\\n\" :begin 7405 :end 7408 :post-blank 1 :parent #5)) #(\":post-blank 0 :post-affiliated 474 :parent #1))))\" 0 49 (:parent #5))))))))
  " :post-blank 0 :post-affiliated 591 :results ("") :parent #2)))))
  #+END_structure-interne

